#+title: Time log
#+MACRO: project (eval (project-name (project-current)))

* Intro
:LOGBOOK:
CLOCK: [2026-06-05 Fri 16:40]--[2026-06-05 Fri 16:48] =>  0:08
:END:

This is a log of the time and steps taken while working on the
{{{project}}}.  I can't say what the result as far as readability will
be.  The first git commit is April 8, 2026.  Today is June 5th.  I
have worked on this off and on so I can't say how many hours has been
put in before this log was started.

* Continue adding to Functions
:LOGBOOK:
CLOCK: [2026-06-10 Wed 08:00]--[2026-06-10 Wed 10:00] =>  2:00
CLOCK: [2026-06-09 Tue 14:42]--[2026-06-09 Tue 18:42] =>  4:00
CLOCK: [2026-06-08 Mon 20:36]--[2026-06-08 Mon 21:37] =>  1:01
CLOCK: [2026-06-05 Fri 16:48]--[2026-06-05 Fri 18:36] =>  1:48
CLOCK: [2026-06-06 Sat 16:48]--[2026-06-06 Sat 18:48] =>  2:00
CLOCK: [2026-06-07 Sun 16:48]--[2026-06-07 Sun 18:48] =>  2:00
CLOCK: [2026-06-08 Mon 16:48]--[2026-06-08 Mon 18:48] =>  2:00
:END:
I started adding to the text and got side tracked into something I've
kinda wanted to do for a while.  This directory is now set up using my
project-setups.org system so that I can define Org variables specific
for this project.  This was caused by me wanting to have the same
"icon" for the INFO button that Canon uses.  This will need to add to
the org-html-head which I haven't done yet.  It is time to eat.
Tomorrow's project.

I finished the description of all the functions.  In the process, I
pulled down the updated HTML versions of the R1 and R5m2 version 1.3.0
documentation and added in the new functions.

* Create ASCII versions of Menus
:LOGBOOK:
CLOCK: [2026-06-10 Wed 16:00]--[2026-06-10 Wed 17:20] =>  1:20
:END:

I'd like to have flat simple ASCII versions of the menus that easily
fit on a phone so that they can be loaded onto a phone and quickly
available.  I can't remember where particular menus are at and I think
this will help me since I will be able to search.

Well... that worked out rather nicely.  I fixed publish.el so that one
call will publish all the pieced and GitHub Pages is hosting it.
Fun!!

* Lets clean a few things up
:LOGBOOK:
CLOCK: [2026-06-10 Wed 17:24]--[2026-06-10 Wed 17:34] =>  0:10
:END:
Redid the README entirely.
